ehmp/product/production/NodeMockServices/data/mvi/1309/0 Results.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vaww="http://vaww.oed.oit.domain">
   <soapenv:Header/>
   <soapenv:Body>
      <vaww:PRPA_IN201310UV02>
      <id root="2.16.840.1.113883.4.349" extension="WS1407171236331391776995038"/>
    <creationTime value="20140717123633"/>
    <versionCode code="3.0"/>
    <interactionId root="2.16.840.1.113883.1.6" extension="PRPA_IN201310UV02"/>
    <processingCode code="T"/>
    <processingModeCode code="T"/>
    <acceptAckCode code="NE"/>
    <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="PSIM_TOOLS" extension="200EHMP"/>
        </device>
    </receiver>
    <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
            <id root="2.16.840.1.113883.4.349" extension="200M"/>
        </device>
    </sender>
    <acknowledgement>
        <typeCode code="AA"/>
        <targetMessage>
            <id root="2.16.840.1.113883.4.349" extension="MCID-YOUR_IDENTIFIER_001"/>
        </targetMessage>
    </acknowledgement>
    <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201310UV02"/>
        <queryAck>
            <queryId root="1.2.840.114350.1.13.99999.4567.34" extension="MCID-YOUR_IDENTIFIER_001"/>
            <queryResponseCode code="NF"/>
        </queryAck>
        <queryByParameter>
            <queryId root="1.2.840.114350.1.13.99999.4567.34" extension="MCID-YOUR_IDENTIFIER_001"/>
            <statusCode code="new"/>
            <responsePriorityCode code="I"/>
            <parameterList>
                <patientIdentifier>
                    <value root="2.16.840.1.113883.4.349" extension=""/>
                    <semanticsText>Patient.Id</semanticsText>
                </patientIdentifier>
            </parameterList>
        </queryByParameter>
    </controlActProcess>

      </vaww:PRPA_IN201310UV02>
   </soapenv:Body>
</soapenv:Envelope>